# 去掉无关维度-tsne前数据预处理
dropKeys = ['part1_HIS', 'part1_cysj', 'part1_rysj', 'part1_sg', 'part1_tz', 'part1_bah', 'part1_pid']
# selectKeys = []
# 血常规
selectKeys1 = ['part1_cyzd1', 'part1_mzfs', 'part1_nl', 'part1_ssmc', 'part1_xb', 'part1_zycs', '平均红细胞体积', '平均RBC血红蛋白含量', '平均RBC血红蛋白浓度', '红细胞体积分布宽度SD', '红细胞体积分布宽度CV', '平均血小板体积', '血小板体积分布宽度', '大血小板比例', '血小板比容', '白细胞计数', '红细胞计数', '血红蛋白浓度', '血小板计数', '中性粒细胞百分比', '单核细胞百分比', '淋巴细胞百分比', '嗜酸粒细胞百分比', '嗜碱粒细胞百分比', '中性粒细胞计数', '单核细胞计数', '淋巴细胞计数', '嗜酸粒细胞计数', '嗜碱粒细胞计数', '红细胞比容' ]
# 生化全套
selectKeys2 =  ['part1_cyzd1', 'part1_mzfs', 'part1_nl', 'part1_ssmc', 'part1_xb', 'part1_zycs', '胱抑素C', '总胆红素', '直接胆红素', '间接胆红素', '谷丙转氨酶', '谷草转氨酶', '总蛋白', '白蛋白', '球蛋白', '白/球比值', '谷酰转肽酶', '碱性磷酸酶', '总胆汁酸', 'a-L-岩藻糖苷酶', '尿素', '血肌酐', '尿酸', '总胆固醇', '甘油三酯', '高密度脂蛋白', '低密度脂蛋白', '极低密度脂蛋白', '载脂蛋白A1','载脂蛋白B', '乳酸脱氢酶', '磷酸肌酸激酶','磷酸肌酸激酶同工酶', '钠', '钾', '氯', '碳酸氢根', '钙', '磷', '胆碱酯酶', '空腹血糖', '前白蛋白', '羟丁酸脱氢酶', '脂蛋白a', '缺铁修饰性白蛋白', 'eGFR']
# selectKeys =  ['part1_cyzd1', 'part1_mzfs', 'part1_nl', 'part1_ssmc', 'part1_xb', 'part1_zycs', '红细胞计数', '红细胞（高倍视野）', '白细胞计数', '上皮细胞计数', 'NON-LYSED RBC#']